//Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6

Console.WriteLine("Задайте число: ");
int numbers = Convert.ToInt32(Console.ReadLine());
int count = 0;
while (count / 999)
{
    Console.WriteLine($"Мы нашли наше число{numbers}");
}
